---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.KickerBraceSymbol
source: html/ed543557-7917-0666-a9ae-3beb9f33fb6a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.KickerBraceSymbol Property

The id of the ElementType to represent a kicker brace.

## Syntax (C#)
```csharp
public ElementId KickerBraceSymbol { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null